In [1]:
import pandas as pd

In [2]:
frame = pd.DataFrame({'number':range(10), 'chars':['a']*10)

In [3]:
frame

   number chars
0       0     a
1       1     a
2       2     a
3       3     a
4       4     a
5       5     a
6       6     a
7       7     a
8       8     a
9       9     a

In [14]:
frame = pd.read_csv('data.tsv', sep='\t', header=0)

In [15]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [17]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [18]:
frame.shape

(6, 4)

In [19]:
new_line = {'Name':'Roma', 'Birth':'11.10.1999', 'City':'Kiev'}

In [24]:
frame = frame.append(new_line, ignore_index=True)

In [25]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6             Roma  11.10.1999       Kiev       NaN

In [30]:
frame['newC'] = ['1']*7

In [31]:
frame

              Name       Birth       City  Position newC
0      Иванов А.А.  22.03.1980     Москва       NaN    1
1     Сорокин И.В.  07.08.1965  Волгоград   инженер    1
2       Белов М.М.  13.02.1980     Ростов  менеджер    1
3  Мельникова Д.С.  15.04.1985     Ростов       NaN    1
4      Рыбина Е.П.  19.11.1985     Москва   инженер    1
5     Костров С.О.  31.05.1985     Москва    стажер    1
6             Roma  11.10.1999       Kiev       NaN    1

In [32]:
frame.drop('newC', axis=1, inplace=True)

In [33]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6             Roma  11.10.1999       Kiev       NaN

In [34]:
frame.drop([5,6], axis=0 ,inplace=True)

In [35]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [36]:
frame.to_csv('new_data.csv', sep=',', header=True, index=None)